#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd][0m
[0m[1mmodule.synology.module.minio.minio_s3_bucket.bucket["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet][0m
[0m[1mmodule.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn][0m
[0m[1mmodule.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.txt_file: Refreshing state... [id=text.txt][0m
[0m[1mmodule.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn][0m
[0m[1mmodule.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd][0m
[0m[1mmodule.synology.module.minio.minio_iam_user.user["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet][0m
[0m[1mmodule.synology.module.minio.minio_iam_policy.policy_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-335be9c5595a4d85e1bf191c172718e4][0m
[0m[1mmodule.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-954ebc35ecca52a899c98bdd9c1762fe][0m
[0m[1mmodule.synology.module.minio.minio_iam_policy.policy["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-03c3c71cc85e3193397f03bdcc2c24cf][0m
[0m[1mmodule.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-335be9c5595a4d85e1bf191c172718e4][0m
[0m[1mmodule.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-335be9c5595a4d85e1bf191c172718e4][0m
[0m[1mmodule.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-705433c3614c5093ab5aabd268719e88][0m
[0m[1mmodule.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20210926180933401600000003][0m
[0m[1mmodule.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-20210926200008455700000001][0m
[0m[1mmodule.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20210926180933399100000002][0m
[0m[1mmodule.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20210926200008566700000003][0m
[0m[1mmodule.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20210926200008502600000002][0m
[0m[1mmodule.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-20210926180933396200000001][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"][0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "minio_iam_user_policy_attachment" "policy_attachment" {
        [1m[0mid[0m[0m          = "tftp-netboot-infinity-gauntlet-20210926180933401600000003"
      [33m~[0m [0m[1m[0mpolicy_name[0m[0m = "tftp-netboot-infinity-gauntlet-03c3c71cc85e3193397f03bdcc2c24cf" [33m->[0m [0m"tftp-netboot-infinity-gauntlet-335be9c5595a4d85e1bf191c172718e4"
        [90m# (1 unchanged attribute hidden)[0m[0m
    }
[1m  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"][0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "minio_iam_user_policy_attachment" "policy_attachment" {
        [1m[0mid[0m[0m          = "state-infinity-gauntlet-etcd-20210926180933399100000002"
      [33m~[0m [0m[1m[0mpolicy_name[0m[0m = "state-infinity-gauntlet-etcd-705433c3614c5093ab5aabd268719e88" [33m->[0m [0m"state-infinity-gauntlet-etcd-335be9c5595a4d85e1bf191c172718e4"
        [90m# (1 unchanged attribute hidden)[0m[0m
    }
[1m  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_longhorn"][0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
        [1m[0mid[0m[0m          = "state-infinity-gauntlet-longhorn-20210926180933396200000001"
      [33m~[0m [0m[1m[0mpolicy_name[0m[0m = "state-infinity-gauntlet-longhorn-335be9c5595a4d85e1bf191c172718e4" [33m->[0m [0m"state-infinity-gauntlet-longhorn-954ebc35ecca52a899c98bdd9c1762fe"
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # module.github.github_repository.example[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "github_repository" "example" {
      [32m+[0m [0m[1m[0mallow_merge_commit[0m[0m     = true
      [32m+[0m [0m[1m[0mallow_rebase_merge[0m[0m     = true
      [32m+[0m [0m[1m[0mallow_squash_merge[0m[0m     = true
      [32m+[0m [0m[1m[0marchived[0m[0m               = false
      [32m+[0m [0m[1m[0mdefault_branch[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdelete_branch_on_merge[0m[0m = false
      [32m+[0m [0m[1m[0mdescription[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mfull_name[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mgit_clone_url[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mhtml_url[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mhttp_clone_url[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                   = "terraform-example"
      [32m+[0m [0m[1m[0mnode_id[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprivate[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mrepo_id[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mssh_clone_url[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msvn_url[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mvisibility[0m[0m             = "public"
    }

[1m  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "minio_iam_user_policy_attachment" "policy_attachment" {
      [33m~[0m [0m[1m[0mid[0m[0m          = "state-infinity-gauntlet-etcd-20210926180933399100000002" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mpolicy_name[0m[0m = "state-infinity-gauntlet-etcd-335be9c5595a4d85e1bf191c172718e4" [33m->[0m [0m"state-infinity-gauntlet-etcd-705433c3614c5093ab5aabd268719e88" [31m# forces replacement[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "minio_iam_user_policy_attachment" "policy_attachment" {
      [33m~[0m [0m[1m[0mid[0m[0m          = "tftp-netboot-infinity-gauntlet-20210926180933401600000003" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mpolicy_name[0m[0m = "tftp-netboot-infinity-gauntlet-335be9c5595a4d85e1bf191c172718e4" [33m->[0m [0m"tftp-netboot-infinity-gauntlet-03c3c71cc85e3193397f03bdcc2c24cf" [31m# forces replacement[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_longhorn"][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
      [33m~[0m [0m[1m[0mid[0m[0m          = "state-infinity-gauntlet-longhorn-20210926180933396200000001" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mpolicy_name[0m[0m = "state-infinity-gauntlet-longhorn-954ebc35ecca52a899c98bdd9c1762fe" [33m->[0m [0m"state-infinity-gauntlet-longhorn-335be9c5595a4d85e1bf191c172718e4" [31m# forces replacement[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[0m[1mPlan:[0m 4 to add, 0 to change, 3 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @WyriHaximus, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*